app/controllers/products_controller.rb

  def index
    @products = Product.all
---
SELECT "products".* FROM "products"