app/controllers/users_controller.rb

  def index
    users = Users.all
---
SELECT "users".* FROM "users"

  def show
    user = Users.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1